Revit 2021.1 API
BuildingType Enumeration
An enumerated type listing all of the built-in parameter groups supported by Autodesk Revit.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)
Syntax
C#
public enum BuildingType
Visual Basic
Public Enumeration BuildingType
Visual C++
public enum class BuildingType
Members
Member name | Description
kNoOfBuildingTypes | Building Type is NoOfBuildingTypes.
kAutomotiveFacility | Building Type is AutomotiveFacility.
kConventionCenter | Building Type is ConventionCenter.
kCourthouse | Building Type is Courthouse.
kDiningBarLoungeOrLeisure | Building Type is DiningBarLoungeOrLeisure.
kDiningCafeteriaFastFood | Building Type is DiningCafeteriaFastFood.
kDiningFamily | Building Type is DiningFamily.
kDormitory | Building Type is Dormitory.
kExerciseCenter | Building Type is ExerciseCenter.
kFireStation | Building Type is FireStation.
kGymnasium | Building Type is Gymnasium.
kHospitalOrHealthcare | Building Type is HospitalOrHealthcare.
kHotel | Building Type is Hotel.
kLibrary | Building Type is Library.
kManufacturing | Building Type is Manufacturing.
kMotel | Building Type is Motel.
kMotionPictureTheatre | Building Type is MotionPictureTheatre.
kMultiFamily | Building Type is MultiFamily.
kMuseum | Building Type is Museum.
kOffice | Building Type is Office.
kParkingGarage | Building Type is ParkingGarage.
kPenitentiary | Building Type is Penitentiary.
kPerformingArtsTheater | Building Type is PerformingArtsTheater.
kPoliceStation | Building Type is PoliceStation.
kPostOffice | Building Type is PostOffice.
kReligiousBuilding | Building Type is ReligiousBuilding.
kRetail | Building Type is Retail.
kSchoolOrUniversity | Building Type is SchoolOrUniversity.
kSportsArena | Building Type is SportsArena.
kTownHall | Building Type is TownHall.
kTransportation | Building Type is Transportation.
kWarehouse | Building Type is Warehouse.
kWorkshop | Building Type is Workshop.
Remarks
Parameter groups are used to sort parameters within the gbXML Setting item of the Project Information dialog.
See Also
Autodesk.Revit.DB Namespace